Процедура ПриСозданииОбъекта()

<<<<<<< HEAD
	Обмен = ЗагрузитьСценарий("core/Обмен.os");
=======
	Обмен = ЗагрузитьСценарий("scripts/Обмен.os");
>>>>>>> 33534b0640816f8e967b99f6b0f498a1a4293b6c

	ИмяФайла = "tmp/module.txt";

	СтарыйТекст = Обмен.ПолучитьТекстИзФайла(ИмяФайла);

	Текст = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8); 
	Текст.Записать(СтарыйТекст); 
	Текст.Закрыть();		
	ОсвободитьОбъект(Текст);

	ЗапуститьПриложение("cmd /K system/OneScript/bin/oscript.exe " + ИмяФайла);

КонецПроцедуры