Перем Обмен;

Процедура ОбработкаТекста(Данные)
	
	Данные = СокрП(Данные);
	РегВыражение = Новый РегулярноеВыражение("^\|");
	Данные = РегВыражение.Заменить(Данные,"");
	Обмен.УстановитьТекстВВыделение(Данные);

КонецПроцедуры

Процедура ПриСозданииОбъекта()

	Обмен = ЗагрузитьСценарий("scripts/Обмен.os");
	ОбработкаТекста(Обмен.ПолучитьВыделенныйТекст());

<<<<<<< HEAD
КонецПроцедуры

Обмен = ЗагрузитьСценарий("core/Обмен.os");

ВыполнитьДействие(АргументыКоманднойСтроки);
=======
КонецПроцедуры
>>>>>>> 33534b0640816f8e967b99f6b0f498a1a4293b6c
